module.exports.config = {
 name: "rules",
 version: "1.0.0",
 hasPermssion: 0,
 credits: "The Mood Embrace",
 description: "Send group rules",
 commandCategory: "information",
 usages: "rules2",
 cooldowns: 5
};

module.exports.run = async ({ api, event }) => {
 const message = `❐-আসসালামু আলাইকুম,🖤🌺
❐- 𝙶𝚁𝙾𝚄𝙿 এর কিছু 𝚁𝚄𝙻𝙴𝚂 আছে, এগুলো হয়তো অনেকেই জানেন না যারা জানেন না তারা জেনে রাখেন⬅️
<------------------------------------------------->

1️⃣ সবাই ভদ্র ভাষায় কথা বলবে
2️⃣ অশালীন বা আপত্তিকর কথা নিষিদ্ধ ❌
3️⃣ রাজনৈতিক/ধর্মীয় উসকানিমূলক পোস্ট করা যাবে না
4️⃣ স্প্যাম, লিংক ও বিজ্ঞাপন শেয়ার নিষেধ
5️⃣ ব্যক্তিগত আক্রমণ বা অপমান করা যাবে না
6️⃣ গ্রুপের স্ক্রিনশট বাইরে শেয়ার করা যাবে না
7️⃣ অ্যাডমিনের সিদ্ধান্ত চূড়ান্ত
8️⃣ নিয়ম ভাঙলে সতর্কতা / মিউট / রিমুভ করা হবে
9️⃣ অ্যাডমিন “Text Off” বললে কোনো ধরনের অপ্রয়োজনীয় মেসেজ বা রিপ্লাই করা যাবে না
🔟 গ্রুপে অ্যাডমিন বা মডারেটর পিক/লাইন দিলে Seen করে অবশ্যই React দিয়ে উপস্থিতি জানাতে হবে
1️⃣1️⃣ Seen করে React না দিলে বা ইচ্ছাকৃতভাবে এড়িয়ে গেলে গ্রুপে রাখা হবে না
1️⃣2️⃣ যেসব পিক বা পোস্টে React দিতে বলা হবে, সেখানে নির্দিষ্ট সময়ের মধ্যে রেসপন্স দেওয়া বাধ্যতামূলক
1️⃣3️⃣ অ্যাডমিন ছাড়া কেউ @everyone বা সবাইকে একসাথে ট্যাগ দিয়ে নোটিফিকেশন দিতে পারবে না
1️⃣4️⃣ একই মেসেজ বারবার পাঠানো, অপ্রয়োজনীয় চ্যাট বা ফ্লাডিং সম্পূর্ণ নিষিদ্ধ
1️⃣5️⃣ গ্রুপের পরিবেশ নষ্ট হয় এমন আচরণ, ট্রল বা ঝামেলা তৈরি করলে সরাসরি ব্যবস্থা নেওয়া হবে 🤝

✅ সুন্দর পরিবেশ রাখতে সবাই নিয়ম মেনে চলুন।
<------------------------------------------------->

𝙱𝙾𝚃 𝙰𝙳𝙼𝙸𝙽: Mahmudur Rahman 
𝙵𝙱 𝙻𝙸𝙽𝙺: https://www.facebook.com/100072704133034

💖...........ধন্যবাদ সবাইকে...........💖`;

 return api.sendMessage(message, event.threadID);
};
